// Составить программу возведения натурального числа в квадрат, используя
// закономерность:
// 1 2 =1
// 2 2 =1+3
// 3 2 =1+3+5
// 4 2 =1+3+5+7
// ...............
// n 2 =1+3+5+7+9+...+2n – 1

#include <iostream>

int main()
{
    int n, result = 0;

    printf("\n\nВведите число: ");
    scanf("%d", &n);

    for (int t = 1; t < n + 1; t++)
        result += 2 * t - 1;

    if (n > 0)
        printf("Результат n^2 = %d\n\n", result);
    else
        printf("Ошибка:введенное число не натуральное\n\n");

    return 0;
}